
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИспользоватьУниверсальныйОбмен = Константы.оду_ИспользоватьУниверсальныйОбмен.Получить();
	ПроверитьНастройкиБД();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//TODO:  Удалить
	//тест
	//ПодключитьОбработчикОжидания("ЗакрытьСразуПриТестировании", 0.1, Истина);
КонецПроцедуры

//TODO:  Удалить
//тест
&НаКлиенте
Процедура ЗакрытьСразуПриТестировании()
	
	ПолныйПуть = "\\pivo.local\Resource\Личные\Кириллов ПС\r\work\! НавигаторОбщий.epf";
	пр_Клиент.ОткрытьФормуВнешнейОбработки(ПолныйПуть, "оду_ФормаНастроекУниверсальногоОбмена",,,, "НавигаторОбщий");
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьУниверсальныйОбменПриИзменении(Элемент)
	Если ПроверитьЗаполнение() Тогда
		ИспользоватьУниверсальныйОбменПриИзмененииНаСервере();
		ОбновитьИнтерфейс();
	Иначе 
		ИспользоватьУниверсальныйОбмен = Ложь;	
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ИспользоватьУниверсальныйОбменПриИзмененииНаСервере()
	Константы.оду_ИспользоватьУниверсальныйОбмен.Установить(ИспользоватьУниверсальныйОбмен);
КонецПроцедуры

&НаСервере
Процедура ПроверитьНастройкиБД()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	оду_НастройкиИнформационнойБазы.ИмяРабочейБД,
		|	оду_НастройкиИнформационнойБазы.СерверРабочейБД,
		|	оду_НастройкиИнформационнойБазы.РежимОтладки,
		|	оду_НастройкиИнформационнойБазы.ПутьКОбработкамОтладки
		|ИЗ
		|	РегистрСведений.оду_НастройкиИнформационнойБазы КАК оду_НастройкиИнформационнойБазы";
	
	РезультатЗапроса = Запрос.Выполнить();

	ЗаполненыНастройкиБД = НЕ РезультатЗапроса.Пустой();
	
	Элементы.СоздатьНастройкиБД.Видимость = НЕ ЗаполненыНастройкиБД;
	
	Если ЗаполненыНастройкиБД = Истина Тогда
		//оду_Общий.ПроверкаУзловОбмена();
		//ПолныйПуть = "\\pivo.local\Resource\Личные\Кириллов ПС\r\work\оду_Общий.epf"; 
		//Результ = пр_Общий.ВыполнитьМетодВнешнейОбработкиПоПути(ПолныйПуть, "ПроверкаУзловОбмена()");
	КонецЕсли; 
	
КонецПроцедуры


&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если ИспользоватьУниверсальныйОбмен = Истина Тогда
		Если ЗаполненыНастройкиБД = Ложь  Тогда
			Отказ = Истина;
			Элементы.СоздатьНастройкиБД.ОтображениеПодсказки = ОтображениеПодсказки.ОтображатьСправа;
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не заполненны основные настройки БД";
			//Сообщение.Поле = "ЗаполненыНастройкиБД";
			Сообщение.Сообщить(); 
		КонецЕсли; 
	КонецЕсли; 
		
КонецПроцедуры


&НаКлиенте
Процедура СоздатьНастройкиБД(Команда)
 	ОписОповещФормы = Новый ОписаниеОповещения("ПослеЗакрытияФормыНастроек", ЭтаФорма); //ЭтаФорма, ЭтотОбъект
	ОткрытьФорму("РегистрСведений.оду_НастройкиИнформационнойБазы.Форма.ФормаСписка",,,,,, ОписОповещФормы);
КонецПроцедуры
  	
&НаКлиенте
Процедура ПослеЗакрытияФормыНастроек(ПараметрыВыбора, Параметры) Экспорт 
	ПроверитьНастройкиБД();
КонецПроцедуры 
