#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если НЕ ЗначениеЗаполнено(Идентификатор) И ЭтоГруппа = Ложь Тогда
		
		Если ЗначениеЗаполнено(Ссылка)  Тогда
			Идентификатор = пр_Общий.ИД_Ссылки(Ссылка);
		Иначе
			СсылкаНового = ЭтотОбъект.ПолучитьСсылкуНового();
			Если НЕ ЗначениеЗаполнено(СсылкаНового)  Тогда
				СсылкаНового = Справочники.пр_Запросы.ПолучитьСсылку();
				Идентификатор = пр_Общий.ИД_Ссылки(СсылкаНового);
			КонецЕсли; 
			ЭтотОбъект.УстановитьСсылкуНового(СсылкаНового);
		КонецЕсли; 	
		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#КонецЕсли
