
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияФормы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ИмяТаблицы

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьЗначенияФормы()
	
	СхемыHTTPАвторизации = СхемыHTTPАвторизации();
	
	Для каждого ЗначениеСхемыHTTPАвторизации Из СхемыHTTPАвторизации Цикл
		Элементы.СхемаHTTPАвторизации.СписокВыбора.Добавить(ЗначениеСхемыHTTPАвторизации);
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Функция СхемыHTTPАвторизации()
	
	СхемыHTTPАвторизации = Новый Массив;
	СхемыHTTPАвторизации.Добавить("Basic");
	СхемыHTTPАвторизации.Добавить("Bearer");
	//СхемыHTTPАвторизации.Добавить("OAuth");
	СхемыHTTPАвторизации.Добавить("OAuth2");
	
	Возврат  СхемыHTTPАвторизации;
	
КонецФункции 

#КонецОбласти

#Область СлужебныеПроцедурыИФункцииБСП

#КонецОбласти