
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПутьКОбработкамОтладкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Каталог = пр_Клиент.ВыборКаталогаФайлаНачалоВыбора(Ложь);
	Если ЗначениеЗаполнено(Каталог)  Тогда
		Запись.ПутьКОбработкамОтладки = Каталог; 
	КонецЕсли; 
	
КонецПроцедуры


&НаКлиенте
Процедура КаталогОбменаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Каталог = пр_Клиент.ВыборКаталогаФайлаНачалоВыбора(Ложь);
	Если ЗначениеЗаполнено(Каталог)  Тогда
		Запись.КаталогОбмена = Каталог; 
	КонецЕсли; 
	
КонецПроцедуры

