
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	//ЗаполнитьЗначенияФормы();
	
КонецПроцедуры



#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	ЗаполнитьАдресРесурса();
КонецПроцедуры

&НаКлиенте
Процедура ВладелецПриИзменении(Элемент)
	ЗаполнитьАдресРесурса();
КонецПроцедуры

&НаКлиенте
Процедура ВерсияПриИзменении(Элемент)
	ЗаполнитьАдресРесурса();
КонецПроцедуры

&НаКлиенте
Процедура ШаблонHTTPМетодаПриИзменении(Элемент)
	ЗаполнитьАдресРесурса();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ИмяТаблицы

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьЗначенияФормы()
	
	СписокHTTPМетодов = СписокHTTPМетодов();
	
	Для каждого ЗначениеHTTPМетода Из СписокHTTPМетодов Цикл
		Элементы.ИмяHTTPМетода.СписокВыбора.Добавить(ЗначениеHTTPМетода);
	КонецЦикла; 
	
	ЗаполнитьАдресРесурса();
	
КонецПроцедуры

&НаСервере
Функция СписокHTTPМетодов()
	
	//СписокHTTPМетодов = Метаданные.СвойстваОбъектов.HTTPМетод;
	СписокHTTPМетодов = Новый Массив;
	СписокHTTPМетодов.Добавить("GET");
	СписокHTTPМетодов.Добавить("POST");
	СписокHTTPМетодов.Добавить("PATCH");
	СписокHTTPМетодов.Добавить("DELETE");
	СписокHTTPМетодов.Добавить("COPY");
	СписокHTTPМетодов.Добавить("PUT");
	
	Возврат  СписокHTTPМетодов;
	
КонецФункции 


//URLСервиса = СтрШаблон("http://%1/%2/%3/%4", Запись.Сервер, Запись.Версия, СервисКод, Запись.Метод);	
Процедура ЗаполнитьАдресРесурса()
	
	АдресРесурса = "";
	
	МассивПолей = СтрРазделить(Объект.ШаблонHTTPМетода, ",");
	
	КоличествоОграничения = МассивПолей.Количество();
	Сч = 1;
	
	Для каждого ИмяПоля Из МассивПолей Цикл
		
		//Если ИмяПоля = "Сервис" Тогда
		//	Значение = Объект.Владелец;	
		//Если ИмяПоля = "Метод" Тогда
		//	Значение = Объект.Наименование;	
		//Иначе
			Значение = Объект[ИмяПоля];		
		//КонецЕсли; 
		
		ДобавитьСтроку(АдресРесурса, КоличествоОграничения, Значение, Сч, "/");
		
	КонецЦикла; 
	
	Объект.АдресРесурса = АдресРесурса;
	
КонецПроцедуры 

Функция ДобавитьСтроку(ТекстДобавления, КоличествоОграничения, Значение, Сч, Разделитель)
	ТекщийРазделитель = ?(Сч = КоличествоОграничения, "", Разделитель);
	ТекстДобавления = СтрШаблон("%1%2%3", ТекстДобавления, Значение, ТекщийРазделитель);
	Сч = Сч + 1;
КонецФункции 


#КонецОбласти

#Область СлужебныеПроцедурыИФункцииБСП

#КонецОбласти