

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьURLСсылкаНаДокументацию();
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// Вставить содержимое обработчика.
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СерверПриИзменении(Элемент)
	ЗаполнитьURLСсылкаНаДокументацию();
КонецПроцедуры

&НаКлиенте
Процедура ВерсияПриИзменении(Элемент)
	ЗаполнитьURLСсылкаНаДокументацию();
КонецПроцедуры

&НаКлиенте
Процедура ШаблонHTTPМетодаПриИзменении(Элемент)
	ЗаполнитьURLСсылкаНаДокументацию();
КонецПроцедуры


&НаКлиенте
Процедура МетодПриИзменении(Элемент)
	ЗаполнитьURLСсылкаНаДокументацию();
КонецПроцедуры

&НаКлиенте
Процедура URLСсылкаНаДокументациюОткрытие(Элемент, СтандартнаяОбработка)
	пр_Клиент.ОткрытьПриложение(Запись.URLСсылкаНаДокументацию);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ИмяТаблицы

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаПолученияНастроекПодключения()
	
	Возврат
	
		"ВЫБРАТЬ
		|	ЕСТЬNULL(СерверИнфо.Сервер, """") КАК Сервер,
		|	ЕСТЬNULL(МетодИнфо.Версия, """") КАК Версия,
		|	ЕСТЬNULL(МетодИнфо.Сервис, """") КАК Сервис,
		|	ЕСТЬNULL(МетодИнфо.Метод, """") КАК Метод
		|ИЗ
		|	(ВЫБРАТЬ
		|		synс_Server.Наименование КАК Сервер
		|	ИЗ
		|		Справочник.synс_Server КАК synс_Server
		|	ГДЕ
		|		synс_Server.Ссылка = &Сервер) КАК СерверИнфо,
		|	(ВЫБРАТЬ
		|		synс_Methods.Версия КАК Версия,
		|		synс_Methods.Владелец.Код КАК Сервис,
		|		synс_Methods.Наименование КАК Метод
		|	ИЗ
		|		Справочник.synс_Methods КАК synс_Methods
		|	ГДЕ
		|		synс_Methods.Ссылка = &Метод) КАК МетодИнфо
		|";
	
КонецФункции 

Процедура ЗаполнитьURLСсылкаНаДокументацию()
	
	URLСервиса = "";
	
	Если НЕ ЗначениеЗаполнено(Запись.Метод) 
		ИЛИ НЕ ЗначениеЗаполнено(Запись.Сервер) Тогда
		Возврат ;
	КонецЕсли; 
	
	АдресРесурса = пр_Общий.ЗначениеРеквизитаПоСсылке(Запись.Метод, "АдресРесурса");
	URLСервиса = СтрШаблон("http://%1/%2", Запись.Сервер, АдресРесурса);	
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = ТекстЗапросаПолученияНастроекПодключения();
	//
	//Запрос.УстановитьПараметр("Метод", Запись.Метод);
	//Запрос.УстановитьПараметр("Сервер", Запись.Сервер);
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//ВДЗ = РезультатЗапроса.Выбрать();
	//
	//Если ВДЗ.Следующий() Тогда
	//	URLСервиса = СтрШаблон("http://%1/%2/%3/%4", ВДЗ.Сервер, ВДЗ.Версия, ВДЗ.Сервис, ВДЗ.Метод);	
	//Иначе
	//	URLСервиса = "";	
	//КонецЕсли; 
	
	//Сервис = пр_Общий.ЗначениеРеквизитаПоСсылке(Запись.Метод, "Владелец");
	//СервисКод = пр_Общий.ЗначениеРеквизитаПоСсылке(Сервис, "Код");
	//
	//МассивПолей = СтрРазделить(Запись.ШаблонHTTPМетода, ",");
	//
	//URLСервиса = "http://";
	//КоличествоОграничения = МассивПолей.Количество();
	//Сч = 1;
	//
	//Для каждого ИмяПоля Из МассивПолей Цикл
	//	
	//	Если ИмяПоля = "Сервис" Тогда
	//		Значение = СервисКод;		
	//	Иначе
	//		Значение = Запись[ИмяПоля];		
	//	КонецЕсли; 
	//	
	//	ДобавитьСтроку(URLСервиса, КоличествоОграничения, Значение, Сч, "/");
	//	
	//КонецЦикла; 
	
	//URLСервиса = СтрШаблон("http://%1/%2/%3/%4", Запись.Сервер, Запись.Версия, СервисКод, Запись.Метод);	
	
КонецПроцедуры 

Функция ДобавитьСтроку(ТекстДобавления, КоличествоОграничения, Значение, Сч, Разделитель)
	ТекщийРазделитель = ?(Сч = КоличествоОграничения, "", Разделитель);
	ТекстДобавления = СтрШаблон("%1%2%3", ТекстДобавления, Значение, ТекщийРазделитель);
	Сч = Сч + 1;
КонецФункции 



#КонецОбласти

#Область СлужебныеПроцедурыИФункцииБСП

#КонецОбласти