
#Область ОбработчикиСобытийФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы  

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ИмяТаблицы

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПодготовитьДанные(Команда)
	ВыполнитьМетодЗапросаВыделеннойСтроки(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьМетодЗапроса(Команда)
	ВыполнитьМетодЗапросаВыделеннойСтроки();
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВыполнитьМетодЗапросаВыделеннойСтроки(ПодготовитьДанные = Ложь)
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ТекЭлемент = Элементы.Список.ТекущаяСтрока;
	
	Если ТекЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Результат = РезультатВыполненияПроизвольногоЗапросаИзСтрокиНаСервере(ТекЭлемент, ПодготовитьДанные);
	
КонецПроцедуры


Функция РезультатВыполненияПроизвольногоЗапросаИзСтрокиНаСервере(ТекЭлемент, ПодготовитьДанные = Ложь)    Экспорт
	
	пр_Модуль = пр_Общий.ИсполняемыйМодуль("оду_Общий", пр_НастройкиПовтИсп.ТекущийПользователь()); 
	Результат = пр_Модуль.РезультатВыполненияПроизвольногоЗапросаИзСтроки(ТекЭлемент, , ПодготовитьДанные);
	Возврат Результат;
	
КонецФункции 

#КонецОбласти

#Область СлужебныеПроцедурыИФункцииБСП

#КонецОбласти