#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

//Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка) 
//	
//	//Если ЗначениеЗаполнено(Данные.Наименование) Тогда
//	СтандартнаяОбработка = Ложь;                                                                                      
//	//Наименование = ?(ЗначениеЗаполнено(Данные.Наименование), СтрШаблон("(%1)", Данные.Наименование), "");
//	//Представление = СтрШаблон("%1 %2", Данные.Код, Наименование);
//	Представление = СтрШаблон("%1 (%2)", Данные.Наименование, Данные.Код);
//	//КонецЕсли;
//	
//КонецПроцедуры

//Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
//	
//	СтандартнаяОбработка = Ложь;
//	Поля.Добавить("Наименование");
//	Поля.Добавить("Код");	
//	
//КонецПроцедуры

#КонецЕсли
