
Процедура ПередЗаписью(Отказ)    
	
	МассивОтборов = Новый Массив;
				  
	Для каждого Стр Из Организации Цикл
	
		ЗаполнитьОтборыПриИзменении(Стр, ТекущаяБД);
		СтруктураОтборов = Новый Структура("ТипXMLОбъектаИсточника, ИДОбъектаИсточника, ТипXMLОбъектаПриемника, ИДОбъектаПриемника"); 
		ЗаполнитьЗначенияСвойств(СтруктураОтборов, Стр);
		МассивОтборов.Добавить(СтруктураОтборов);
		
	КонецЦикла;
	
	Если МассивОтборов.Количество() > 0 Тогда
		ОтборыОбмена = ЗначениеВСтрокуВнутр(МассивОтборов);
	Иначе
		ОтборыОбмена = "";
	КонецЕсли;
		
КонецПроцедуры

Процедура ЗаполнитьОтборыПриИзменении(ТекЭлемент, ЭтоТекущаяБД)  Экспорт
	 
	Если ЗначениеЗаполнено(ТекЭлемент.Организация)  Тогда
		
		Если ЭтоТекущаяБД = Истина Тогда
			
			ТекЭлемент.ИДОбъектаИсточника = пр_Общий.ИД_Ссылки(ТекЭлемент.Организация);
			Если НЕ ЗначениеЗаполнено(ТекЭлемент.ИДОбъектаПриемника) Тогда
				ТекЭлемент.ИДОбъектаПриемника = ТекЭлемент.ИДОбъектаИсточника;  //По умолчанию они равны
			КонецЕсли; 

			ТипXML = пр_Общий.ИмяТипаXMLПоСсылке(ТекЭлемент.Организация);
			ТекЭлемент.ТипXMLОбъектаИсточника = ТипXML; 
			Если НЕ ЗначениеЗаполнено(ТекЭлемент.ТипXMLОбъектаПриемника) Тогда
				ТекЭлемент.ТипXMLОбъектаПриемника = ТипXML;  //По умолчанию они равны
			КонецЕсли;    
			
		Иначе 
			
			ТекЭлемент.ИДОбъектаПриемника = пр_Общий.ИД_Ссылки(ТекЭлемент.Организация);
			Если НЕ ЗначениеЗаполнено(ТекЭлемент.ИДОбъектаИсточника) Тогда
				ТекЭлемент.ИДОбъектаИсточника = ТекЭлемент.ИДОбъектаПриемника;  //По умолчанию они равны
			КонецЕсли;    
			
			ТипXML = пр_Общий.ИмяТипаXMLПоСсылке(ТекЭлемент.Организация);
			ТекЭлемент.ТипXMLОбъектаПриемника = ТипXML;
			Если НЕ ЗначениеЗаполнено(ТекЭлемент.ТипXMLОбъектаИсточника) Тогда
				ТекЭлемент.ТипXMLОбъектаИсточника = ТипXML;  //По умолчанию они равны
			КонецЕсли;    
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры