
#Область  ПрограммныйИнтерфейс

#Область  Каталоги_ПутьФайлов

//Функция Проверяет наличие каталога на диске и предлагает создать, если каталога не существует.
//
// Параметры
//  ПутьККаталогу  – Строка, содержащая путь к каталогу файла на диске.
//
// Возвращаемое значение:
//   Булево – Истина, если каталог существует или создан, Ложь, если каталога нет.
//
Функция РезультатПодготовкиПутиКФайлу(ПолныйПутьКФайлу, СтруктураПутиФайла = Неопределено) Экспорт
	
	Попытка
		
		Если СтруктураПутиФайла = Неопределено Тогда
			СтруктураПутиФайла = СтруктураПутиФайла(ПолныйПутьКФайлу);
		КонецЕсли; 
		
		ПутьККаталогу = СтруктураПутиФайла.КаталогФайла;
		СоздатьКаталог(ПутьККаталогу);
		
		Возврат Истина;
		
	Исключение
		Возврат Ложь;
	КонецПопытки; 
	
КонецФункции

Функция СтруктураПутиФайла(ПолныйПутьФайла)  Экспорт
	
	СтруктураПутиФайла = Новый Структура();
	
	ДлинаРазделенияФайла = СтрНайти(ПолныйПутьФайла, "\", НаправлениеПоиска.СКонца) - 1;
	СтруктураПутиФайла.Вставить("КаталогФайла", Лев(ПолныйПутьФайла, ДлинаРазделенияФайла));
	СтруктураПутиФайла.Вставить("ПолноеИмяФайла", Прав(ПолныйПутьФайла, СтрДлина(ПолныйПутьФайла) - ДлинаРазделенияФайла - 1));
	
	МассивПутиФайла = СтрРазделить(СтруктураПутиФайла.ПолноеИмяФайла, ".", Ложь);
	
	СтруктураПутиФайла.Вставить("ИмяФайла", МассивПутиФайла[0]);
	СтруктураПутиФайла.Вставить("РасширениеФайла", МассивПутиФайла[1]);
	
	Возврат  СтруктураПутиФайла;
	
КонецФункции 

//Возвращает уникальный путь с привязкой во времени
//
// Параметры:
//  <ПутьККаталогу>  - Строка - Путь к папке
//                 Пример: \\pivo.local\Resource\Личные\Кириллов ПС
//  <ИмяФайла>  - Строка - имя файла
//                 Пример: "ТестовыеДанные"
//  <ПериодХраненияФайла>  - Строка - Год, Месяц, День, Час, Минута, Секунда
//	по умолчанию "Год"
//	<РасширениеФайла>  - Строка - привер: ".json"
//  <ФорматПериодаХраненияФайла>  - Строка - чз Конструктор форматной строки
//
//пример ПутьККаталогу = "\\pivo.local\Resource\Личные\Кириллов ПС\Кпс_Разработка\Задачи\УТ Меркурий\ayan#2021_034#УТ Меркурий Не передаются новые Нмоенклатуры  Кириллов П.С.\ТестовыеДанные  2021_05_11 10_31.json";
Функция ВернутьПолныйПутьКфайлуПоДате(ПутьККаталогу, ИмяФайла = "", РасширениеФайла, ПериодХраненияФайла = "Год", ФорматПериодаХраненияФайла = "" )   Экспорт
	
	Если ПутьККаталогу = "" Тогда
	 	ПолныйПуть = "";
		Возврат ПолныйПуть;
	КонецЕсли;
	
	ПроверитьСоздатьКаталог(ПутьККаталогу);
	ФорматСохраненияФайла = "";
	
	Если РасширениеФайла = Неопределено Тогда
		РасширениеФайла = "json";
	КонецЕсли; 
	
	Если  ФорматПериодаХраненияФайла = "" Тогда
		ФорматСохраненияФайла = "ДФ='";
		Если  ПериодХраненияФайла = "Год" Тогда
			ФорматСохраненияФайла = ФорматСохраненияФайла + "yyyy";		
		ИначеЕсли   ПериодХраненияФайла = "Месяц" Тогда
			ФорматСохраненияФайла = ФорматСохраненияФайла + "yyyy.MM";
		ИначеЕсли   ПериодХраненияФайла = "День" Тогда
			ФорматСохраненияФайла = ФорматСохраненияФайла + "yyyy.MM.dd";		
		ИначеЕсли   ПериодХраненияФайла = "Час" Тогда
			ФорматСохраненияФайла = ФорматСохраненияФайла + "yyyy.MM.dd hh";
		ИначеЕсли   ПериодХраненияФайла = "Минута" Тогда
			ФорматСохраненияФайла = ФорматСохраненияФайла + "yyyy.MM.dd hh.mm";
		ИначеЕсли   ПериодХраненияФайла = "Секунда" Тогда
			ФорматСохраненияФайла = ФорматСохраненияФайла + "yyyy.MM.dd hh.mm.ss";
		Иначе
			ФорматСохраненияФайла = "";
		КонецЕсли; 
		
		ФорматСохраненияФайла = ?(ФорматСохраненияФайла = "", "", ФорматСохраненияФайла + "'");
	Иначе
		ФорматСохраненияФайла = ФорматПериодаХраненияФайла;	
	КонецЕсли; 
	
	ДатаОтправки = "";
	Если ФорматСохраненияФайла <> "" Тогда
		ДатаОтправки = Формат(ТекущаяДата(), ФорматСохраненияФайла);
		ДатаОтправки = СтрЗаменить(ДатаОтправки, ".", "_");
		ДатаОтправки = " " + ДатаОтправки;
	КонецЕсли; 
	
	ПолныйПуть = ПутьККаталогу + "\" + ИмяФайла + ДатаОтправки + "." + РасширениеФайла;
	
	Возврат   ПолныйПуть;
	
КонецФункции

Процедура ПроверитьСоздатьКаталог(ПутьККаталогу) Экспорт
	КаталогНаДиске = Новый Файл(ПутьККаталогу);
	Если НЕ КаталогНаДиске.Существует() Тогда	
		СоздатьКаталог(ПутьККаталогу);
	КонецЕсли;
КонецПроцедуры

Функция КаталогФайла(ПолныйПутьФайла, НомерВхождения = 1)  Экспорт
	
	КаталогФайла = Лев(ПолныйПутьФайла, СтрНайти(ПолныйПутьФайла, "\", НаправлениеПоиска.СКонца,, НомерВхождения) - 1);
	Возврат	КаталогФайла;
	
КонецФункции 

#КонецОбласти

//Проверка струкутры
Функция ЗначениеРеквизитаОбъектаМожетНеБыть(Объект, ИмяРеквизита)	Экспорт
	
	СтруктураПоиска = Новый Структура(ИмяРеквизита, Неопределено); 
	ЗаполнитьЗначенияСвойств(СтруктураПоиска, Объект); 
	Возврат  СтруктураПоиска[ИмяРеквизита];
	
КонецФункции 


Процедура ЗначениеОбъектаЕслиНеЗаполненно(Объект, ИмяРеквизита, Значение) Экспорт
	
	Попытка
		
		РеквизитОбъекта = Объект[ИмяРеквизита];
		Если Не ЗначениеЗаполнено(РеквизитОбъекта)  Тогда
			РеквизитОбъекта = Значение;			
		КонецЕсли; 
		
	Исключение
		пр_Ошибка = ОписаниеОшибки();
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = пр_Ошибка;
		Сообщение.Сообщить(); 
	КонецПопытки;
	
КонецПроцедуры

#Область  ЛогированиеОтладка

//TODO:  
//пр_Результат = пр_Общий.РезультатЗаписиВЛог("<?"Модуль_ИмяМетода">", Объект1С, пр_Ошибка, ТипСсылки, Ссылка, ВходящиеДанные, Пользователь, ПериодЗаписи);
Функция ЗафиксироватьОшибкуDev(ОшибкаДляТелеграмм = "", Метод = "", Объект1С = Неопределено, Данные = Неопределено, ОтправлятьВТелеграмм = Истина, ПоказатьОшибку = Истина, ДопИнформация = Неопределено, Версия = "")  Экспорт
	
	Если ОшибкаДляТелеграмм <> "" И ПоказатьОшибку = Истина Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ОшибкаДляТелеграмм;
		Сообщение.Сообщить(); 
	КонецЕсли; 
	
	Если ОтправлятьВТелеграмм = Истина Тогда
		пр_Общий.ОтправитьСообщениеВТелеграмDev(Метод, Объект1С, ОшибкаДляТелеграмм, Версия, Данные, ДопИнформация);
	КонецЕсли; 
	
КонецФункции  

 
//Для тестирования
// Для преобразования Параметров - ДанныеФормыСтруктура - в структуру в событии: ПриСозданииНаСервере
// Для передачи этих параметров в форму отладки
#Область  ПараметрыФормыВРежимеОтладки

Функция СтрокаСтруктурыИзДанныхФормы(ПараметрыФормы)  Экспорт
	
	СтруктураПараметров = СтруктураИзДанныхФормыXML(ПараметрыФормы);
	СтрокаСтруктуры = пр_Общий.ЗначениеВСтроку(СтруктураПараметров);
	
	Возврат СтрокаСтруктуры;
	
КонецФункции 

//Самая производительный метод 1:3
Функция СтруктураИзДанныхФормыXML(ПараметрыФормы) Экспорт
    
    Если ТипЗнч(ПараметрыФормы) = Тип("Структура") Тогда
        Возврат ПараметрыФормы;
    КонецЕсли;
    
    СтруктураРезультат    = Новый Структура;
    
    //ПараметрыФормы в строку XML
    ЗаписьXML = Новый ЗаписьXML;
    ЗаписьXML.УстановитьСтроку();
    СериализаторXDTO.ЗаписатьXML(ЗаписьXML, ПараметрыФормы, НазначениеТипаXML.Явное);
    СтрокаXML    = ЗаписьXML.Закрыть();
    
    //Чтение ключей параметров формы из строки XML
    ЧтениеXML = Новый ЧтениеXML;
    ЧтениеXML.УстановитьСтроку(СтрокаXML);
    
    Пока ЧтениеXML.Прочитать() Цикл
        
        Если ЧтениеXML.Имя = "structure"
            И ЧтениеXML.ПолучитьАтрибут("name") = "parameters"
            И ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
            
            Прервать;
                        
        ИначеЕсли ЧтениеXML.Имя = "field" Тогда
            
            ТекущийКлюч    = ЧтениеXML.ПолучитьАтрибут("nameRu");
            ТекущийКлюч    = ?(ЗначениеЗаполнено(ТекущийКлюч), ТекущийКлюч, ЧтениеXML.ПолучитьАтрибут("name"));
            Если ЗначениеЗаполнено(ТекущийКлюч) Тогда
                СтруктураРезультат.Вставить(ТекущийКлюч);
            КонецЕсли;
            
        КонецЕсли;
        
    КонецЦикла;
    
    ЧтениеXML.Закрыть();
    
    ЗаполнитьЗначенияСвойств(СтруктураРезультат, ПараметрыФормы);
    
    Возврат СтруктураРезультат;
    
КонецФункции

Функция СтруктураИзДанныхФормыFastInfoset(ДанныеФормы) Экспорт
	
	Массив = Новый Массив;
	Массив.Добавить(ДанныеФормы);
	Запись = Новый ЗаписьFastInfoset;
	Запись.УстановитьДвоичныеДанные();
	СериализаторXDTO.ЗаписатьXML(Запись, Массив);
	
	Чтение = Новый ЧтениеFastInfoset;
	Чтение.УстановитьДвоичныеДанные(Запись.Закрыть());
	Результат = Новый Структура;
	
	Пока Чтение.Прочитать() Цикл
		Если Чтение.Имя = "field" И Чтение.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			ИмяПоля = Чтение.ЗначениеАтрибута("nameRu");
			Если ИмяПоля = Неопределено Тогда
				ИмяПоля = Чтение.ЗначениеАтрибута("name");
			КонецЕсли;
			
			Если ИмяПоля <> Неопределено Тогда
				Результат.Вставить(ИмяПоля);
			КонецЕсли;                
		КонецЕсли;
	КонецЦикла;
	
	ЗаполнитьЗначенияСвойств(Результат, ДанныеФормы); 
	Возврат Результат;
	
КонецФункции

#КонецОбласти
 
#КонецОбласти
 
//СписокСвойств - Для заполнении формы из структуры через метод  ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры, Параметры.СписокСвойств); 
Процедура СписокСвойствВСтруктуру(СтруктураДанных)  Экспорт
	
	СписокСвойств = "";
	Для каждого КлючЗначение Из СтруктураДанных  Цикл
		СписокСвойств = СписокСвойств + КлючЗначение.Ключ + ",";
	КонецЦикла; 
	СписокСвойств = ?(СписокСвойств = "", "", Лев(СписокСвойств, СтрДлина(СписокСвойств)-1));
	СтруктураДанных.Вставить("СписокСвойств", СписокСвойств);
	
КонецПроцедуры

Функция ДобавитьСтрокуСРазделителем(ТекстДобавления, Разделитель)  Экспорт 
	
	ТекщийРазделитель = ?(ЗначениеЗаполнено(ТекстДобавления), Разделитель, "");
	ТекстДобавления = СтрШаблон("%1%2", ТекстДобавления, ТекщийРазделитель);
	Возврат ТекстДобавления;
	
КонецФункции


Функция ДобавитьСтрокуПоСчетчику(ТекстДобавления, КоличествоОграничения, Значение, Сч = 0, Разделитель) Экспорт
	
	ТекщийРазделитель = ?(Сч = КоличествоОграничения, "", Разделитель);
	ТекстДобавления = СтрШаблон("%1%2%3", ТекстДобавления, Значение, ТекщийРазделитель);
	Сч = Сч + 1;
	
КонецФункции 

Функция ЦифрыИзСтроки(ИсходнаяСтрока) Экспорт
	
	СтрокаРезультат = "";
	
	Для Сч = 1 По СтрДлина(ИсходнаяСтрока) Цикл
		ТекущийСимвол = Сред(ИсходнаяСтрока, Сч, 1);
		КодСимвола = КодСимвола(ТекущийСимвол);
		Если КодСимвола >= 48 И КодСимвола <= 57 Тогда
			СтрокаРезультат = СтрокаРезультат + ТекущийСимвол;
		КонецЕсли;
	КонецЦикла;
	
	Возврат СтрокаРезультат;
	
КонецФункции

Функция ЧислоИзСтроки(ИсходнаяСтрока) Экспорт
	
	ЧислоИзСтроки = Число(ЦифрыИзСтроки(ИсходнаяСтрока));
	
	Возврат ЧислоИзСтроки;
	
КонецФункции

Процедура Подождать(Сек) Экспорт
	
	ПланДата = ТекущаяДата() + Сек;
	
	Пока ТекущаяДата() < ПланДата Цикл
		//Ожидание количество сек
	КонецЦикла; 

КонецПроцедуры

#КонецОбласти

#Область  СлужебныйПрограммныйИнтерфейс

#КонецОбласти

#Область  СлужебныеПроцедурыИФункции

#КонецОбласти