
#Область  ПрограммныйИнтерфейс

Функция СтруктураРезультата()  Экспорт
	
	Результат = Новый Структура();
	Результат.Вставить("КодРезультата", 200);	 //см. Коды ответов REST API
	Результат.Вставить("ОписаниеОшибки", "");	 //  
	Результат.Вставить("ДанныеРезультата", Неопределено);
	Результат.Вставить("ИнформацияВыполнения", ""); // Если требуется запротоколировать результат   
	Возврат Результат;
	
КонецФункции

Процедура ЗафиксироватьСобытиеРезультата(СтруктураРезультата, ОписаниеСобытия, ЭтоОшибка = Ложь)  Экспорт
         
	Если ЭтоОшибка = Истина Тогда
		ИнформацияСобытия = пр_КлиентСервер.ДобавитьСтрокуСРазделителем(СтруктураРезультата.ОписаниеОшибки);  
		СтруктураРезультата.КодРезультата = 501;   
		СтруктураРезультата.ОписаниеОшибки = ИнформацияСобытия + ОписаниеСобытия;  
	Иначе
		ИнформацияСобытия = СтрШаблон("%1 : %2", ТекущаяДатаСеанса(), ОписаниеСобытия);	
		ИнформацияВыполнения =  пр_КлиентСервер.ДобавитьСтрокуСРазделителем(СтруктураРезультата.ИнформацияВыполнения);
		ИнформацияВыполнения = ИнформацияВыполнения + ИнформацияСобытия;      
		СтруктураРезультата.ИнформацияВыполнения = ИнформацияВыполнения;
	КонецЕсли;

КонецПроцедуры

#Область JSON

#Область  ЗаписьJSON 

// Формирует текст JSON
//
// Параметры:
//  Данные  - <Тип.Вид> - <описание параметра>
//  Путь - путь к файлу - записывает JSON в файл
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция СформироватьJSON(СтруктураДанных, ФормироватьСПереносами = Ложь,  Путь = "", Сериализовать = Ложь) Экспорт
	
	Если СтруктураДанных = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли; 
	
	Попытка
		
		ЗаписьJSON = Новый ЗаписьJSON;
		ПереносСтрок = ?(ФормироватьСПереносами = Истина, ПереносСтрокJSON.Авто, ПереносСтрокJSON.Нет);
		ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(ПереносСтрок, Символы.Таб);
		
		Если Путь = "" Тогда
			ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
		Иначе 	
			ЗаписьJSON.ОткрытьФайл(Путь,,,ПараметрыЗаписиJSON);
		КонецЕсли; 
		
		Если Сериализовать = Ложь Тогда
			НастройкиСериализацииJSON = Новый НастройкиСериализацииJSON;
			НастройкиСериализацииJSON.ВариантЗаписиДаты = ВариантЗаписиДатыJSON.ЛокальнаяДатаСоСмещением;
			НастройкиСериализацииJSON.ФорматСериализацииДаты = ФорматДатыJSON.ISO;
		
			ЗаписатьJSON(ЗаписьJSON, СтруктураДанных, НастройкиСериализацииJSON);
		Иначе
			СериализаторXDTO.ЗаписатьJSON(ЗаписьJSON, СтруктураДанных, НазначениеТипаXML.Явное);
		КонецЕсли;
		
		ТелоЗапроса = ЗаписьJSON.Закрыть();
		
		Возврат ТелоЗапроса
		
	Исключение
		пр_Ошибка = ОписаниеОшибки();
		пр_КлиентСервер.ЗафиксироватьОшибкуDev(пр_Ошибка, "СформироватьJSON");
	КонецПопытки; 
	
КонецФункции

#КонецОбласти
 
#Область  ЧтениеJSON 

Функция ПрочитатьJSON_ИзТела(ТелоЗапроса = Неопределено, ИменаПолейДат = "",  Путь = "", Сериализовать = Ложь)   Экспорт
	
	Попытка
		
		ЧтениеJSON = Новый ЧтениеJSON;
		
		Если Путь <> "" Тогда
			ЧтениеJSON.ОткрытьФайл(Путь);
		ИначеЕсли ТипЗнч(ТелоЗапроса) = Тип("Поток") Тогда
			ЧтениеJSON.ОткрытьПоток(ТелоЗапроса);
		Иначе
			ЧтениеJSON.УстановитьСтроку(ТелоЗапроса);
		КонецЕсли; 
		
		Если Сериализовать = Истина Тогда
			ДанныеHTTPЗапроса = СериализаторXDTO.ПрочитатьJSON(ЧтениеJSON);
		Иначе	
			Если ИменаПолейДат = "" Тогда
				ДанныеHTTPЗапроса = ПрочитатьJSON(ЧтениеJSON);
			Иначе
				ДанныеHTTPЗапроса = ПрочитатьJSON(ЧтениеJSON,, ИменаПолейДат, ФорматДатыJSON.ISO);
			КонецЕсли; 
		КонецЕсли; 
		
		ЧтениеJSON.Закрыть();
		
		Возврат ДанныеHTTPЗапроса;
		
	Исключение
		пр_Ошибка = ОписаниеОшибки();
		пр_КлиентСервер.ЗафиксироватьОшибкуDev(пр_Ошибка, "ПрочитатьJSON_ИзТела");
	КонецПопытки; 
	
КонецФункции

#КонецОбласти 

#КонецОбласти

#Область HTTP_Сервис 

Функция СтруктураИзТелаHTTPЗапроса(Запрос, СерилизоватьXDTO = Ложь, ИменаПолейДат = "")   Экспорт
	
	Попытка
		
		ТелоЗапроса = Запрос.ПолучитьТелоКакПоток();
		
		ДанныеHTTPЗапроса = ПрочитатьJSON_ИзТела(ТелоЗапроса, ИменаПолейДат, , СерилизоватьXDTO);
		
		Возврат ДанныеHTTPЗапроса;
		
	Исключение
		
		пр_Ошибка = ОписаниеОшибки();
		пр_КлиентСервер.ЗафиксироватьОшибкуDev(пр_Ошибка, "СтруктураИзТелаHTTPЗапроса");
		 
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции


#КонецОбласти
 
#Область  unixtime

Функция ДатаUnixtime(ДатаВремя1С = Неопределено)  Экспорт
	
	ТДатаВремя1С = ?(ТипЗнч(ДатаВремя1С) = Тип("Дата"), ДатаВремя1С, ТекущаяДатаСеанса());
	//ДатаUnixtime = Формат(Число(ТДатаВремя1С - Дата("19700101")),"ЧН=0; ЧГ=0");
	ДатаUnixtime = Формат(Число(ТДатаВремя1С - Дата("19700101") - 7*60*60),"ЧН=0; ЧГ=0");  // с учетом часового пояса
	Возврат   ДатаUnixtime;

КонецФункции // ДатаUnixtime()
 
Функция ДатаВремя1С_Unixtime(ДатаUnixtime)  Экспорт
	
	Попытка
	    ТДатаUnixtime = ?(ТипЗнч(ДатаUnixtime) = Тип("Строка"), Число(ДатаUnixtime), ДатаUnixtime);
		//ДатаВремя1С = Дата("19700101")+ ТДатаUnixtime;
		ДатаВремя1С = Дата("19700101")+ ТДатаUnixtime + 7*60*60;  // с учетом часового пояса
	Исключение
		Возврат Неопределено;
	КонецПопытки;	
	
	Возврат   ДатаВремя1С;

КонецФункции // Дата1CUnixtime()

#КонецОбласти

#КонецОбласти

#Область  СлужебныйПрограммныйИнтерфейс

#КонецОбласти

#Область  СлужебныеПроцедурыИФункции

#КонецОбласти
