
&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	//ВыполнитьМетодЗапросаВыделеннойСтроки();
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьМетодЗапроса(Команда)
	ВыполнитьМетодЗапросаВыделеннойСтроки();
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьМетодЗапросаВыделеннойСтроки(ПодготовитьДанные = Ложь)
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ТекЭлемент = Элементы.Список.ТекущаяСтрока;
	
	Если ТекЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Результат = РезультатВыполненияПроизвольногоЗапросаИзСтрокиНаСервере(ТекЭлемент, ПодготовитьДанные);
	
КонецПроцедуры


Функция РезультатВыполненияПроизвольногоЗапросаИзСтрокиНаСервере(ТекЭлемент, ПодготовитьДанные = Ложь)    Экспорт
	
	пр_Модуль = пр_Общий.ИсполняемыйМодуль("оду_Общий", пр_НастройкиПовтИсп.ТекущийПользователь()); 
	Результат = пр_Модуль.РезультатВыполненияПроизвольногоЗапросаИзСтроки(ТекЭлемент, , ПодготовитьДанные);
	Возврат Результат;
	
КонецФункции 


&НаКлиенте
Процедура ПодготовитьДанные(Команда)
	ВыполнитьМетодЗапросаВыделеннойСтроки(Истина);
КонецПроцедуры
