
//Возвращает уникальный путь с привязкой во времени
//
// Параметры:
//  <ПутьККаталогу>  - Строка - Путь к папке
//                 Пример: \\pivo.local\Resource\Личные\Кириллов ПС
//  <ИмяФайла>  - Строка - имя файла
//                 Пример: "ТестовыеДанные"
//  <ПериодХраненияФайла>  - Строка - Год, Месяц, День, Час, Минута, Секунда
//	по умолчанию "Год"
//	<РасширениеФайла>  - Строка - привер: ".json"
//  <ФорматПериодаХраненияФайла>  - Строка - чз Конструктор форматной строки
//
//пример ПутьККаталогу = "\\pivo.local\Resource\Личные\Кириллов ПС\Кпс_Разработка\Задачи\УТ Меркурий\ayan#2021_034#УТ Меркурий Не передаются новые Нмоенклатуры  Кириллов П.С.\ТестовыеДанные  2021_05_11 10_31.json";
Функция ВернутьПолныйПутьКфайлуПоДате(ПутьККаталогу, ИмяФайла = "", РасширениеФайла, ПериодХраненияФайла = "Год", ФорматПериодаХраненияФайла = "" )   Экспорт
	
	Если ПутьККаталогу = "" Тогда
	 	ПолныйПуть = "";
		Возврат ПолныйПуть;
	КонецЕсли;
	
	ПроверитьСоздатьКаталог(ПутьККаталогу);
	ФорматСохраненияФайла = "";
	
	Если РасширениеФайла = Неопределено Тогда
		РасширениеФайла = "json";
	КонецЕсли; 
	
	Если  ФорматПериодаХраненияФайла = "" Тогда
		ФорматСохраненияФайла = "ДФ='";
		Если  ПериодХраненияФайла = "Год" Тогда
			ФорматСохраненияФайла = ФорматСохраненияФайла + "yyyy";		
		ИначеЕсли   ПериодХраненияФайла = "Месяц" Тогда
			ФорматСохраненияФайла = ФорматСохраненияФайла + "yyyy.MM";
		ИначеЕсли   ПериодХраненияФайла = "День" Тогда
			ФорматСохраненияФайла = ФорматСохраненияФайла + "yyyy.MM.dd";		
		ИначеЕсли   ПериодХраненияФайла = "Час" Тогда
			ФорматСохраненияФайла = ФорматСохраненияФайла + "yyyy.MM.dd hh";
		ИначеЕсли   ПериодХраненияФайла = "Минута" Тогда
			ФорматСохраненияФайла = ФорматСохраненияФайла + "yyyy.MM.dd hh.mm";
		ИначеЕсли   ПериодХраненияФайла = "Секунда" Тогда
			ФорматСохраненияФайла = ФорматСохраненияФайла + "yyyy.MM.dd hh.mm.ss";
		Иначе
			ФорматСохраненияФайла = "";
		КонецЕсли; 
		
		ФорматСохраненияФайла = ?(ФорматСохраненияФайла = "", "", ФорматСохраненияФайла + "'");
	Иначе
		ФорматСохраненияФайла = ФорматПериодаХраненияФайла;	
	КонецЕсли; 
	
	ДатаОтправки = "";
	Если ФорматСохраненияФайла <> "" Тогда
		ДатаОтправки = Формат(ТекущаяДата(), ФорматСохраненияФайла);
		ДатаОтправки = СтрЗаменить(ДатаОтправки, ".", "_");
		ДатаОтправки = " " + ДатаОтправки;
	КонецЕсли; 
	
	ПолныйПуть = ПутьККаталогу + "\" + ИмяФайла + ДатаОтправки + "." + РасширениеФайла;
	
	Возврат   ПолныйПуть;
	
КонецФункции
 

Процедура ПроверитьСоздатьКаталог(ПутьККаталогу) Экспорт
	КаталогНаДиске = Новый Файл(ПутьККаталогу);
	Если НЕ КаталогНаДиске.Существует() Тогда	
		СоздатьКаталог(ПутьККаталогу);
	КонецЕсли;
КонецПроцедуры

//Проверка струкутры
Функция ЗначениеРеквизитаОбъектаМожетНеБыть(Объект, ИмяРеквизита)	Экспорт
	
	СтруктураПоиска = Новый Структура(ИмяРеквизита, Неопределено); 
	ЗаполнитьЗначенияСвойств(СтруктураПоиска, Объект); 
	Возврат  СтруктураПоиска[ИмяРеквизита];
	
КонецФункции 

Процедура Подождать(Сек) Экспорт
	
	ПланДата = ТекущаяДата() + Сек;
	
	Пока ТекущаяДата() < ПланДата Цикл
		//Ожидание количество сек
	КонецЦикла; 

КонецПроцедуры