
&НаКлиенте
Процедура ПутьКОбработкеОтладкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОписОповещФормы = Новый ОписаниеОповещения("ПослеВыбораФайла", ЭтаФорма); //ЭтаФорма, ЭтотОбъект
	пр_Клиент.УстановкаКаталогаФайлаНачалоВыбора(ЭтаФорма, "ПутьКОбработкеОтладки", ,,, ОписОповещФормы);
	
КонецПроцедуры  


&НаКлиенте
//Какие параметры могут передаваться:
//ПараметрыЗакрытия, СтандартныеРеквизиты, ФормаРедактированияСтроки, СтруктураПараметров, ВыполняемоеОповещение, Результат, ИсточникВыбора 
Процедура ПослеВыбораФайла(Результат, Параметры) Экспорт 
	
	ПутьКОбработке = Результат; 	
	Если ЗначениеЗаполнено(ПутьКОбработке)  Тогда
		Запись.ПутьКОбработкеОтладки = ПутьКОбработке;
		Запись.Использовать = Истина;
		Если НЕ ЗначениеЗаполнено(Запись.Модуль)  Тогда
			МассивыПути = СтрРазделить(ПутьКОбработке, "/\");
			ИмяФайла = МассивыПути[МассивыПути.ВГраница()];
			Запись.Модуль = СтрРазделить(ИмяФайла, ".")[0];
		КонецЕсли;
	Иначе 
		Запись.Использовать = Ложь;
	КонецЕсли; 
	
КонецПроцедуры