
&НаКлиенте
Процедура ПутьКОбработкеОтладкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ПутьКОбработке = пр_Клиент.ВыборКаталогаФайлаНачалоВыбора();
	Если ЗначениеЗаполнено(ПутьКОбработке)  Тогда
		Запись.ПутьКОбработкеОтладки = ПутьКОбработке;
		Запись.Использовать = Истина;
		Если НЕ ЗначениеЗаполнено(Запись.Модуль)  Тогда
			МассивыПути = СтрРазделить(ПутьКОбработке, "/\");
			ИмяФайла = МассивыПути[МассивыПути.ВГраница()];
		    Запись.Модуль = СтрРазделить(ИмяФайла, ".")[0];
		КонецЕсли;
	Иначе 
		Запись.Использовать = Ложь;
	КонецЕсли; 
	
КонецПроцедуры
