
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Запись.ОбъектОбмена) Тогда
		Возврат;
	КонецЕсли;
	
	//Если ЗначениеЗаполнено(Запись.ИДОбъекта) Тогда
	//	Если Запись.РежимОбмена = оду_ОбщийПовтИсп.РежимВыгрузка() И ЗначениеЗаполнено(Запись.ТипXMLОбъектаИсточника)  Тогда
	//		Запись.ОбъектОбмена = пр_Общий.СсылкаПоТипXML(Запись.ТипXMLОбъектаИсточника, Запись.ИДОбъекта);
	//	ИначеЕсли  Запись.РежимОбмена = оду_ОбщийПовтИсп.РежимЗагрузка() И ЗначениеЗаполнено(Запись.ТипXMLОбъектаПриемника) Тогда 	
	//		Запись.ОбъектОбмена = пр_Общий.СсылкаПоТипXML(Запись.ТипXMLОбъектаПриемника, Запись.ИДОбъекта);
	//	КонецЕсли; 
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяФайлаОбменаОчистка(Элемент, СтандартнаяОбработка)
	УдалитьФайлы(Запись.ИмяФайлаОбмена);
	Запись.ИмяФайлаОбмена = "";
КонецПроцедуры

&НаКлиенте
Процедура ИмяФайлаОбменаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ИмяФайлаОбмена = пр_Клиент.ВыборКаталогаФайлаНачалоВыбора();
КонецПроцедуры

&НаКлиенте
Процедура ИмяФайлаОбменаОткрытие(Элемент, СтандартнаяОбработка)
	ОткрытьЗначение(Запись.ИмяФайлаОбмена);
КонецПроцедуры
