
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс
	
//Функция ТекстЗапросаПолученияНастроекПодключения()
//	
//	Возврат
//	
//		"ВЫБРАТЬ
//		|	ЕСТЬNULL(pet_ConnectionSettings.Сервер.Наименование, """") КАК Сервер,
//		|	pet_ConnectionSettings.Сервер.Порт КАК СерверПорт,
//		|	pet_ConnectionSettings.Сервер.Таймаут КАК СерверТаймаут,
//		|	pet_ConnectionSettings.Сервер.Login КАК СерверLogin,
//		|	pet_ConnectionSettings.Сервер.Password КАК СерверPassword,
//		|	ЕСТЬNULL(pet_ConnectionSettings.Метод.Владелец.Родитель.Наименование, """") КАК Версия,
//		|	ЕСТЬNULL(pet_ConnectionSettings.Метод.Владелец.Наименование, """") КАК Сервис,
//		|	ЕСТЬNULL(pet_ConnectionSettings.Метод.Наименование, """") КАК Метод
//		|ИЗ
//		|	РегистрСведений.pet_ConnectionSettings КАК pet_ConnectionSettings
//		|ГДЕ
//		|	pet_ConnectionSettings.Метод.Наименование = &ИмяМетода
//		|	И pet_ConnectionSettings.Использовать = ИСТИНА";
//	
//КонецФункции 

//Функция НастройкиПодключенияПоИмениМетода(ИмяМетода)  Экспорт
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = ТекстЗапросаПолученияНастроекПодключения();
//	
//	Запрос.УстановитьПараметр("ИмяМетода", ИмяМетода);
//	
//	РезультатЗапроса = Запрос.Выполнить();
//	
//	Возврат пр_Общий.СтруктураПоЗапросу(РезультатЗапроса);
//	
//КонецФункции 

#Область ДляВызоваИзДругихПодсистем

#КонецОбласти

#КонецОбласти

#КонецЕсли