
&НаКлиенте
Процедура ПутьКОбработкеИсточникНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ПутьКОбработке = пр_Клиент.ВыборКаталогаФайлаНачалоВыбора();
	Если ЗначениеЗаполнено(ПутьКОбработке)  Тогда
		Запись.ПутьКОбработкеИсточник = ПутьКОбработке;	
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ПутьКОбработкеПриемникНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ПутьКОбработке = пр_Клиент.ВыборКаталогаФайлаНачалоВыбора();
	Если ЗначениеЗаполнено(ПутьКОбработке)  Тогда
		Запись.ПутьКОбработкеПриемник = ПутьКОбработке;	
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьМетодЗапроса(Команда)
	ВыполнитьМетодЗапросаНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВыполнитьМетодЗапросаНаСервере(ПодготовитьДанные = Ложь)
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	//СтруктураПараметров = оду_Общий.СтруктураИнструкцииВыполненияЗапроса();
	//ЗаполнитьЗначенияСвойств(СтруктураПараметров, Запись); 
	пр_Модуль = пр_Общий.ИсполняемыйМодуль("оду_Общий", пр_НастройкиПовтИсп.ТекущийПользователь()); 
	РезультатВыполнения = пр_Модуль.РезультатВыполненияПроизвольногоЗапросаИзСтроки(, Запись, ПодготовитьДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодготовитьДанные(Команда)
	ВыполнитьМетодЗапросаНаСервере(Истина);
КонецПроцедуры
