
Процедура ПередЗаписью(Отказ)  
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("ТипXMLОбъектаИсточника", ОбщегоНазначения.ОписаниеТипаСтрока(150));
	ТЗ.Колонки.Добавить("ТипXMLОбъектаПриемника", ОбщегоНазначения.ОписаниеТипаСтрока(150));
	ТЗ.Колонки.Добавить("ИДОбъектаИсточника", ОбщегоНазначения.ОписаниеТипаСтрока(36));
	ТЗ.Колонки.Добавить("ИДОбъектаПриемника", ОбщегоНазначения.ОписаниеТипаСтрока(36));
	
	//МассивОтборов = Новый Массив;
				  
	Для каждого Стр Из Организации Цикл
		
		ЗаполнитьОтборыПриИзменении(Стр, ТекущаяБД);
		
		//СтруктураОтборов = СтруктураОтборов();
		//ЗаполнитьЗначенияСвойств(СтруктураОтборов, Стр);
		//МассивОтборов.Добавить(СтруктураОтборов);
		
		Нстр = ТЗ.Добавить();	
		ЗаполнитьЗначенияСвойств(Нстр, Стр);
		
	КонецЦикла; 
	
	ЗаполнитьОтборПоСкладу(ТЗ);    
	
	СтруктураОтборов = СтруктураДанныхОтборов(ТЗ);
	

	//Если МассивОтборов.Количество() > 0 Тогда
		//ОтборыОбмена = ЗначениеВСтрокуВнутр(МассивОтборов);
	Если СтруктураОтборов.Количество() > 0 Тогда
		ОтборыОбмена = ЗначениеВСтрокуВнутр(СтруктураОтборов);
	Иначе
		ОтборыОбмена = "";
	КонецЕсли;
		
КонецПроцедуры 


Функция СтруктураДанныхОтборов(ТЗ)
	
	СтруктураДанныхОтборов = Новый Структура();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЗ.ТипXMLОбъектаИсточника КАК ТипXMLОбъектаИсточника,
		|	ТЗ.ТипXMLОбъектаПриемника КАК ТипXMLОбъектаПриемника,
		|	ТЗ.ИДОбъектаИсточника КАК ИДОбъектаИсточника,
		|	ТЗ.ИДОбъектаПриемника КАК ИДОбъектаПриемника
		|ПОМЕСТИТЬ ВТ_Данные
		|ИЗ
		|	&ТЗ КАК ТЗ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Данные.ТипXMLОбъектаИсточника КАК ТипXMLОбъектаИсточника,
		|	ВТ_Данные.ТипXMLОбъектаПриемника КАК ТипXMLОбъектаПриемника,
		|	ВТ_Данные.ИДОбъектаИсточника КАК ИДОбъектаИсточника,
		|	ВТ_Данные.ИДОбъектаПриемника КАК ИДОбъектаПриемника
		|ИЗ
		|	ВТ_Данные КАК ВТ_Данные
		|ИТОГИ ПО
		|	ТипXMLОбъектаИсточника";    
	
	Запрос.УстановитьПараметр("ТЗ", ТЗ);	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаТипXMLОбъектаИсточника = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаТипXMLОбъектаИсточника.Следующий() Цикл
		
		ВДЗ = ВыборкаТипXMLОбъектаИсточника.Выбрать();
		
		МассивОтборов = Новый Массив;
		Пока ВДЗ.Следующий() Цикл
			СтруктураОтборов = СтруктураОтборов();
			ЗаполнитьЗначенияСвойств(СтруктураОтборов, ВДЗ);
			МассивОтборов.Добавить(СтруктураОтборов);
		КонецЦикла;      
		
		Если МассивОтборов.Количество() > 0 Тогда
			ИмяТипа = СтрЗаменить(ВыборкаТипXMLОбъектаИсточника.ТипXMLОбъектаИсточника, ".", "_");	
			СтруктураДанныхОтборов.Вставить(ИмяТипа, МассивОтборов);	
		КонецЕсли;
		
	КонецЦикла; 
	
	Возврат СтруктураДанныхОтборов; 

КонецФункции

Функция СтруктураОтборов()
	СтруктураОтборов = Новый Структура("ТипXMLОбъектаИсточника, ИДОбъектаИсточника, ТипXMLОбъектаПриемника, ИДОбъектаПриемника");
	Возврат СтруктураОтборов;
КонецФункции

Процедура ЗаполнитьОтборыПриИзменении(ТекЭлемент, ЭтоТекущаяБД)  Экспорт
	 
	Если ЗначениеЗаполнено(ТекЭлемент.Организация)  Тогда
		
		Если ЭтоТекущаяБД = Истина Тогда
			
			ТекЭлемент.ИДОбъектаИсточника = пр_Общий.ИД_Ссылки(ТекЭлемент.Организация);
			Если НЕ ЗначениеЗаполнено(ТекЭлемент.ИДОбъектаПриемника) Тогда
				ТекЭлемент.ИДОбъектаПриемника = ТекЭлемент.ИДОбъектаИсточника;  //По умолчанию они равны
			КонецЕсли; 

			ТипXML = пр_Общий.ИмяТипаXMLПоСсылке(ТекЭлемент.Организация);
			ТекЭлемент.ТипXMLОбъектаИсточника = ТипXML; 
			Если НЕ ЗначениеЗаполнено(ТекЭлемент.ТипXMLОбъектаПриемника) Тогда
				ТекЭлемент.ТипXMLОбъектаПриемника = ТипXML;  //По умолчанию они равны
			КонецЕсли;    
			
		Иначе 
			
			ТекЭлемент.ИДОбъектаПриемника = пр_Общий.ИД_Ссылки(ТекЭлемент.Организация);
			Если НЕ ЗначениеЗаполнено(ТекЭлемент.ИДОбъектаИсточника) Тогда
				ТекЭлемент.ИДОбъектаИсточника = ТекЭлемент.ИДОбъектаПриемника;  //По умолчанию они равны
			КонецЕсли;    
			
			ТипXML = пр_Общий.ИмяТипаXMLПоСсылке(ТекЭлемент.Организация);
			ТекЭлемент.ТипXMLОбъектаПриемника = ТипXML;
			Если НЕ ЗначениеЗаполнено(ТекЭлемент.ТипXMLОбъектаИсточника) Тогда
				ТекЭлемент.ТипXMLОбъектаИсточника = ТипXML;  //По умолчанию они равны
			КонецЕсли;    
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьОтборПоСкладу(ТЗ)
	
	Если Метаданные.Справочники.оду_БазыУчастникиОбмена.Реквизиты.Найти("Склад") = Неопределено Тогда
		Возврат;	
	КонецЕсли;  
	
	Если НЕ ЗначениеЗаполнено(Склад) Тогда
		Возврат;	
	КонецЕсли;
	
	СтруктураОтборов = ТЗ.Добавить();	
	//СтруктураОтборов = СтруктураОтборов(); 
	ТипXMLОбъекта = пр_Общий.ИмяТипаXMLПоСсылке(Склад);
	ИДОбъекта = пр_Общий.ИД_Ссылки(Склад);
	
	СтруктураОтборов.ТипXMLОбъектаИсточника = ТипXMLОбъекта;
	СтруктураОтборов.ТипXMLОбъектаПриемника = ТипXMLОбъекта;   
	СтруктураОтборов.ИДОбъектаИсточника = ИДОбъекта;
	СтруктураОтборов.ИДОбъектаПриемника = ИДОбъекта;   
	
КонецПроцедуры
